import re

TASK_RE = re.compile(r"^(\d{1,2}|\w)+?\)\s")

CHAPTER_RE = re.compile(r"(^[А-ЯЁA-Z]-\d+\*?.?)+?\s.*")

ANSWER_CHAPTER_RE = re.compile(r"^([A-ZА-ЯЁ]-\d{1,2}\*?)")

TASK_NUMBER_RE = re.compile(r"^\(?(\d)\)?$")

VAR_RE = re.compile(r"[B|В][a|а][p|р][u|и|n][a|а]нт[\s|']?(\d|\w)",
                    re.IGNORECASE)

LEVEL_RE = re.compile(r"^[у|y][p|р][o|о]в[e|е]н[b|ь]\s.?(\w).?$",
                      re.IGNORECASE)

SYMBOLS = cyrillic_translit_map = {
    # Латинские буквы и цифры, похожие на кириллицу
    'a': 'А', 'A': 'А',
    'B': 'В', 'E': 'Е', 'e': 'е',
    'T': 'Т', 'M': 'М', 'H': 'Н',
    'K': 'К', 'k': 'к',
    'X': 'Х', 'x': 'х',
    'O': 'О', 'o': 'о',
    'C': 'С', 'c': 'с',
    'P': 'Р', 'p': 'р',
    'y': 'у', 'Y': 'У',
    '3': 'З', '3': 'З',
    '0': 'О',
    '4': 'Ч',
    '6': 'б',
    '9': 'д',
    'I': 'И', 'i': 'и',
    'N': 'П',
    'r': 'г',
    'g': 'д',
    'D': 'Д',
    'F': 'Ф',
    'L': 'Л',
    'U': 'Ц',
    'W': 'Ш', 'w': 'ш',
    'V': 'В', 'v': 'в',
    'S': 'З', 's': 'з',
    'Z': 'Э', 'z': 'э',
    'J': 'Ж', 'j': 'ж',
    'm': 'м',
    'h': 'н',
    'b': 'ь',
    'd': 'д',
    'q': 'я',
    'R': 'Я',
}
